## Production: heartbeat
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `module.heartbeat.aws_cloudwatch_query_definition.lambda_statistics` |
|        | `module.heartbeat.aws_lambda_alias.this[0]`                          |
| update | `module.heartbeat.aws_lambda_function.this`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.heartbeat.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "aws_cloudwatch_log_group.this",
        ]
      + name                = "Lambda Statistics - heartbeat"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.heartbeat.aws_lambda_alias.this[0] will be created
  + resource "aws_lambda_alias" "this" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = "heartbeat"
      + function_version = "6"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

  # module.heartbeat.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "heartbeat"
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "heartbeat_sms_number" = "+16135550123" -> "16135550123"
                # (2 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.heartbeat_testing[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.heartbeat_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-heartbeat-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-heartbeat-api[0]"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
